app/Controllers/Login.php

SELECT *
FROM `tbl_user`
WHERE `email_user` = 'rama@gmail.com'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $userModel = new UserModel();
        $email = $this->request->getPost('email_user');
        $password = $this->request->getPost('password_user');

        $user = $userModel->where('email_user', $email)->first();