app/Models/M_keranjang.php

SELECT `tbl_keranjang`.*, `tbl_barang`.*, (tbl_keranjang.jumlah_order * tbl_barang.harga_barang) as total_harga
FROM `tbl_keranjang`
LEFT JOIN `tbl_barang` ON `tbl_barang`.`kode_barang` = `tbl_keranjang`.`kode_barang`
WHERE `tbl_keranjang`.`id_user` = '3'
ORDER BY `jumlah_order` ASC
---
    function list_all($id_user) {
        $builder = $this->db->table('tbl_keranjang');
        $builder->select('tbl_keranjang.*, tbl_barang.*, (tbl_keranjang.jumlah_order * tbl_barang.harga_barang) as total_harga');
        $builder->join('tbl_barang', 'tbl_barang.kode_barang = tbl_keranjang.kode_barang', 'left');
        $builder->where('tbl_keranjang.id_user', $id_user); // Filter by user
        $builder->orderBy($this->orderBy, $this->orderByType);
        $query = $builder->get();