app/Models/M_order.php

    public function getKodeKeranjang()
    {
        return $this->db->table('tbl_pesanan')
            ->select('kode_keranjang')
            ->get()
            ->getResult();
---
SELECT `kode_keranjang`
FROM `tbl_pesanan`